app/Controllers/usuario_controller.php

        }
        // Guardado si todo está bien
        else {
            $formModel->save([
                'nombre'   => $this->request->getVar('nombre'),
                'apellido' => $this->request->getVar('apellido'),
                'usuario' => $this->request->getVar('usuario'),
                'email'   => $this->request->getVar('email'),
                'pass'    => password_hash($this->request->getVar('pass'), PASSWORD_DEFAULT),
                'perfil_id' => 2, // por defecto, usuario normal
                'baja' => 'NO'
            ]);
---
INSERT INTO `usuarios` (`nombre`, `apellido`, `usuario`, `email`, `pass`, `perfil_id`, `baja`) VALUES ('Ivan', 'Suarez', 'ivan13', 'ivan13@gmail.com', '$2y$10$8OufpH/Aa3WuSLMRF3isPOPBaSIHP9.KENH9y/YWiui.wtn63hoKS', 2, 'NO')

 public function index()
{
    $session = session();
    if ($session->get('perfil_id') != 1) {
        return redirect()->to('/')->with('fail', 'Acceso no autorizado');
    }

    $model = new usuario_Model();
    $data['usuarios'] = $model->where('baja', 'NO')->findAll(); // solo activos
---
SELECT *
FROM `usuarios`
WHERE `baja` = 'NO'

    public function baja($id)
    {
        $model = new usuario_Model();
        $model->update($id, ['baja' => 'SI']);
---
UPDATE `usuarios` SET `baja` = 'SI'
WHERE `usuarios`.`id_usuario` IN ('18')

    public function alta($id)
    {
        $model = new usuario_Model();
        $model->update($id, ['baja' => 'NO']);
---
UPDATE `usuarios` SET `baja` = 'NO'
WHERE `usuarios`.`id_usuario` IN ('3')

   public function inactivos()
{
    $session = session();
    if ($session->get('perfil_id') != 1) {
        return redirect()->to('/')->with('fail', 'Acceso no autorizado');
    }

    $model = new usuario_Model();
    $data['usuarios'] = $model->where('baja', 'SI')->findAll(); // solo inactivos
---
SELECT *
FROM `usuarios`
WHERE `baja` = 'SI'